#include <iostream>
using namespace std;

#include <memory>

/**********************************************
 * 智能指针，模板类，内部实现计数器，自动释放内存
 * 调用析构函数
 * shared_ptr
 * unique_ptr
 * weak_ptr
***********************************************/

/**************************************
 * 1.内存泄漏 没有及时释放内存
 * 2.非法访问 错误释放内存
***************************************/


/**********************************************
 * make_shared<T>
 * 库函数返回智能指针
***********************************************/
int main()
{
    shared_ptr<int> p = make_shared<int>(10);

    // 结合使用时需要直接初始化
    shared_ptr<int> p2(new int(10));

    cout << *p << endl;

}